src/main/resources/soap.ftl

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:fak="http://www.example.org/FakeFlexicube/">
    <soapenv:Body>
        <fak:FakeElement>
            ${body}
        </fak:FakeElement>
    </soapenv:Body>
</soapenv:Envelope>